# Run `brew bundle` to install all packages listed below. Search for packages at https://brew.sh/.
# Refer to https://github.com/Homebrew/homebrew-bundle for details on `brew bundle`.

# TODO
# - Launcher: https://www.monarchlauncher.com/, https://www.raycast.com/
# - Clipboard manager/history (Might be redundant with a launcher): https://maccy.app/
# - Window management: https://highlyopinionated.co/swish/, https://rectangleapp.com/, https://bentoboxapp.com/, https://github.com/nikitabobko/AeroSpace
# - Music (Subsonic for my Navidrome instance): https://submarinerapp.com/
# - Keyboard remapping: https://karabiner-elements.pqrs.org/
# - Global keyboard shorcuts/hotkeys: https://github.com/koekeishiya/skhd

# Same as running `brew tap (...)`
tap "homebrew/cask" # Install GUI apps with Homebrew Cask | https://github.com/Homebrew/homebrew-cask
tap "buo/cask-upgrade" # CLI tool (`brew cu`) to upgrade outdated apps installed via Homebrew Cask | https://github.com/buo/homebrew-cask-upgrade
tap "hashicorp/tap" # To install Terraform's latest version | https://developer.hashicorp.com/terraform/install

# Same as running `brew install (...)`
brew "awscli" # CLI to manage AWS services | https://aws.amazon.com/cli/
brew "bat" # Modern alternative to `cat` | https://github.com/sharkdp/bat
brew "chezmoi" # Manage dotfiles/configurations across multiple systems | https://www.chezmoi.io/
brew "devcontainer" # Development containers | https://containers.dev/
brew "direnv" # Automatically load ENV variables when you `cd` into a directory | https://direnv.net/
brew "eza" # Modern alternative to `ls` | https://eza.rocks/
brew "fd" # Modern alternative to `fd` | https://github.com/sharkdp/fd
brew "fzf" # Fuzzy finder | https://github.com/junegunn/fzf
brew "gh" # GitHub CLI | https://cli.github.com/
brew "git" # Version control system | https://git-scm.com/
brew "git-delta" # Syntax-highlighting pager for git | https://github.com/dandavison/delta
brew "git-lfs" # Git extension for large file storage | https://git-lfs.com/
brew "hashicorp/tap/terraform" # Infrastructure as Code tool | https://www.terraform.io/
brew "jq" # CLI JSON processor | https://jqlang.org/
brew "lf" # Terminal file manager | https://github.com/gokcehan/lf
brew "neovim" # Text editor | https://neovim.io/
brew "rclone" # CLI to manage files on cloud storage | https://rclone.org/
brew "ripgrep" # Search tool | https://github.com/BurntSushi/ripgrep
brew "shellcheck" # Static analysis and linting for shell scripts | https://www.shellcheck.net/
brew "starship" # Customizable prompt for any shell | https://starship.rs/
brew "tlrc" # Collaborative cheatsheets for CLI tools | https://github.com/tldr-pages/tlrc

# Same as running `brew install --cask (...)`
cask "1password" # Password manager | https://1password.com/
cask "1password-cli" # 1Password CLI | https://developer.1password.com/docs/cli/
cask "anytype" # Note-taking app | https://anytype.io/
cask "devtoys" # Collection of developer tools (conversions, formatters, etc...) | https://devtoys.app/
cask "discord" # Communication tool | https://discord.com/
cask "espanso" # Text expander | https://espanso.org/
cask "flameshot", postinstall: "open flameshot.app" # Screenshot tool | https://flameshot.org/ - TODO: Test if the postinstall works to address the issue listed here https://flameshot.org/docs/installation/installation-osx/
cask "ghostty" # Terminal | https://ghostty.org/
cask "google-chrome" # Web browser | https://www.google.com/chrome/
cask "hiddenbar" # Hide unneeded menu bar icons on MacOS | https://github.com/dwarvesf/hidden/
cask "jetbrains-toolbox" # Install/Update JetBrains IDEs | https://www.jetbrains.com/toolbox-app/
cask "keymapp" # Companion app for ZSA keyboards to view their layout | https://www.zsa.io/flash
cask "microsoft-teams" # Communication tool at work | https://www.microsoft.com/en/microsoft-teams
cask "mullvadvpn" # VPN | https://mullvad.net/
cask "orbstack" # Alternative to Docker Desktop | https://orbstack.dev/

brew "mas" # Install apps from Mac App Store | https://github.com/mas-cli/mas
# First step is to get/purchase the applications from the Mac App Store.
# Afterwards, this below is the same as running `mas install (...)`. Find the app name and ID from the URL of its Mac App Store page.
mas "amphetamine", id: 937_984_704
